; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-19)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room4)
(at ball12 room5)
(at ball13 room5)
(at ball14 room5)
(at ball15 room5)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 room3)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room5)
(at ball14 room5)
(at ball15 room6)
(at ball16 room6)
(at ball17 room6)
(at ball18 room6)
(at ball19 room6)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 14 of 19
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 19
3. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 15 of 19
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 15 of 19
5. (pick ball15 room5 left)
   deleted: (at ball15 room5) (free left)
   added: (carry ball15 left)
   goals met: 15 of 19
6. (pick ball12 room5 right)
   deleted: (at ball12 room5) (free right)
   added: (carry ball12 right)
   goals met: 15 of 19
7. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 15 of 19
8. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 15 of 19
9. (drop ball15 room6 left)
   deleted: (carry ball15 left)
   added: (at ball15 room6) (free left)
   goals met: 16 of 19
10. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 16 of 19
11. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 16 of 19
12. (drop ball12 room4 right)
   deleted: (carry ball12 right)
   added: (at ball12 room4) (free right)
   goals met: 17 of 19
13. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 17 of 19
14. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 17 of 19
15. (pick ball10 room3 right)
   deleted: (at ball10 room3) (free right)
   added: (carry ball10 right)
   goals met: 17 of 19
16. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 17 of 19
17. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 18 of 19
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 18 of 19
19. (drop ball10 room4 right)
   deleted: (carry ball10 right)
   added: (at ball10 room4) (free right)
   goals met: 19 of 19
